#+title: Cryptographically Signed License Issuance with Payment in Cryptocurrency
#+author: Perry Kundert
#+email: perry@kundert.ca
#+date: 2022-01-25 12:32:00
#+draft: false
#+EXPORT_FILE_NAME: README.pdf
#+STARTUP: org-startup-with-inline-images inlineimages
#+STARTUP: org-latex-tables-centered nil

#+OPTIONS: ^:nil # Disable sub/superscripting with bare _; _{...} still works
#+OPTIONS: toc:nil

#+LATEX_HEADER: \usepackage[margin=1.0in]{geometry}

#+BEGIN_SRC emacs-lisp :noweb no-export :exports results
;; Tables not centered
(
 setq org-latex-tables-centered nil
      org-src-preserve-indentation t
      org-edit-src-content-indentation 0
      org-confirm-babel-evaluate nil
)
nil
#+END_SRC

#+RESULTS:

#+BEGIN_ABSTRACT
Licensing software and getting paid for it has become extremely difficult, due to government,
regulatory and banking interference.

The =crypto-licensing= Python module allows you automatically and securely issue licenses, and get
paid in various cryptocurrencies.
#+END_ABSTRACT

#+TOC: headlines 3

*** =authoring=: Creating an Authoring Keypair

    The raw =ed25519.Keypair= from =authoring= isn't serializable, so get a =crypto_licensing=
    =KeypairEncrypted= and save its =str( <KeypairEncrypted> )= output to a file.

    #+LATEX: {\scriptsize
    #+BEGIN_SRC ipython :session :exports both :results raw drawer
    import crypto_licensing as cl
    username		= 'admin@awesome-inc.com'
    password		= 'password'
    auth_keypair	= None or cl.authoring( seed=b'\xff' * 32 ) # don't do, unless you have a random seed!
    encr_keypair	= cl.KeypairEncrypted( auth_keypair, username=username, password=password )
    decr_keypair	= cl.KeypairPlaintext( encr_keypair.into_keypair( username=username, password=password ))
    [
        [ "Plaintext:", "" ],
        [ "verifying", decr_keypair['vk'] ],
        [ "signing", decr_keypair['sk'] ],
        [ "Encrypted:" ],
        [ "salt", encr_keypair['salt'] ],
        [ "ciphertext", encr_keypair['ciphertext'] ],
    ]
    #+END_SRC

    #+RESULTS:
    :results:
   # Out[35]:
   | 0          | 1                                                                                                |
   |------------+--------------------------------------------------------------------------------------------------|
   | Plaintext: |                                                                                                  |
   | verifying  | dqFZIESm5PURJlvKc6YE2QsFKdHfYCvjChmpJXZg0fU=                                                     |
   | signing    | //////////////////////////////////////////92oVkgRKbk9REmW8pzpgTZCwUp0d9gK+MKGakldmDR9Q==         |
   | Encrypted: |                                                                                                  |
   | salt       | 156dd79ff272ee57eca219eb                                                                         |
   | ciphertext | 4aa6a946a22eb4444064d115286c352469a4e7ebdf41a61c2d31e68e1652f4917926b4a6910b5a9e48a3e74cd332a739 |
   :end:

    #+LATEX: }

